Revit 2024 API
BuiltInFailures.CopyPasteFailures.CopyImposterLightError Property
 Light source cannot be copied!
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CopyImposterLightError { get; }
Visual Basic
Public Shared ReadOnly Property CopyImposterLightError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CopyImposterLightError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace